<a href="https://colab.research.google.com/github/rlawkdgn123/python/blob/master/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
path = '/content/drive/My Drive/0-Dream/Data/score/score/A 학교출신 지원자.csv'

In [13]:
df = pd.read_csv(path, encoding='cp949')
df.head()

  출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
0    A  30104  조매미  70  66  78   38   42
1    A  30115  김개미  71  77  89   15   20
2    A  30117  박모기  76  55  75   35   30
3    A  30120  최파리  69  66  51   15   36
4    A  30215  정땅벌  63  20  76   15   19

In [14]:
df.tail(3)

   출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
26    A  30827  허대구  95  70  67   35   29
27    A  30901  유명태  87  69  96   37   40
28    A  30928  남동태  91  50  80   29   26

In [0]:
df.info()

In [0]:
df['과탐1'].head()

In [0]:
df['과탐평균']=df['과탐1']*0.5+df['과탐2']+0.5
df[['과탐평균']].head()

In [0]:
df.head()

In [0]:
re = (lambda a: a+10)(1)
re

In [24]:
a=[3,5,11,100]
a

[3, 5, 11, 100]

In [25]:
max(a)

100

In [26]:
f = lambda x,y : x+y
f(5,10)

15

In [27]:
max_lam = (lambda a : max(a))
print(a)
max_lam(a)

[3, 5, 11, 100]

100

In [0]:
df[['과탐1','과탐2']]

In [0]:
a=input('여러개 숫자입력>>> ').split()
a, type(a__list)

In [0]:
list+map(int, a_list)
list_num

In [0]:
df['과탐상위']df['과탐1',['과탐2']].apply(lambda a : max(a), axis=1)
[['과탐상위']].head()

In [0]:
df['변환점수']=df['국어']*0.2+df['수학']*0.4+(df['과탐1']*0.4+(df['과탐2'])*0.4)
df[['변환점수']].head()

In [0]:
df.sort_values('변환점수',ascending=False).head(10)